[
    {
        "id": 1,
        "title": "Fed raises interest rates by 0.25%, USD surges",
        "excerpt": "The US Federal Reserve (Fed) has decided to raise interest rates by 0.25% in its March meeting, pushing the USD to a 3-month high.",
        "content": "The US Federal Reserve (Fed) has decided to raise interest rates by 0.25% in its March meeting, pushing the USD to its highest level in three months. This decision was made amid inflation still above the Fed's 2% target. Fed Chair Jerome Powell stated that the central bank will continue to closely monitor economic indicators to make appropriate decisions in future meetings. The forex market reacted strongly to this news, with the USD rising sharply against other major currencies. EUR/USD fell to 1.0850, GBP/USD dropped to 1.2650, and USD/JPY rose to 150.50. Experts predict the USD could continue to strengthen in the short term due to favorable interest rate differentials.",
        "category": "Fundamental Analysis",
        "author": "Nguyen Huu Nghia",
        "publishedAt": "2024-03-20T10:00:00Z",
        "readTime": 5,
        "image": "/news/news1.png",
        "tags": [
            "Fed",
            "USD",
            "Interest rates",
            "EUR/USD",
            "GBP/USD"
        ]
    },
    {
        "id": 2,
        "title": "EUR/USD breaks 1.0800 support level",
        "excerpt": "The EUR/USD pair has broken the key 1.0800 support level, opening up trading opportunities for traders.",
        "content": "The EUR/USD pair has broken the key 1.0800 support level in today's trading session, opening up trading opportunities for traders. This breakout occurred after the Fed raised interest rates while the ECB (European Central Bank) kept rates unchanged. From a technical analysis perspective, EUR/USD is currently in a short-term downtrend, with the next support targets at 1.0750 and 1.0700. The RSI is at 30, indicating the market is oversold and may see a slight rebound. However, the main trend remains bearish due to favorable interest rate differentials for the USD. Traders should watch upcoming key economic events such as the US Non-Farm Payroll report and the ECB meeting.",
        "category": "Technical Analysis",
        "author": "Tran Van Hieu",
        "publishedAt": "2024-03-19T14:30:00Z",
        "readTime": 4,
        "image": "/news/news2.png",
        "tags": [
            "EUR/USD",
            "Technical Analysis",
            "Support",
            "Resistance",
            "RSI"
        ]
    },
    {
        "id": 3,
        "title": "GBP/USD jumps after UK inflation report",
        "excerpt": "The British pound rose sharply after UK inflation data came in higher than expected, boosting expectations that the BoE will raise rates.",
        "content": "The British pound rose sharply after UK inflation data came in higher than expected, boosting expectations that the BoE (Bank of England) will raise interest rates in its next meeting. The UK CPI rose 4.0% year-on-year, above the expected 3.8%. This pushed GBP/USD from 1.2650 to 1.2750 during the trading session. Experts believe the BoE may raise rates by another 0.25% next month to control inflation. However, it should be noted that the UK economy is facing challenges and rate hikes could slow growth. Traders should monitor key upcoming UK economic reports in the next week.",
        "category": "Market News",
        "author": "James",
        "publishedAt": "2024-03-18T09:15:00Z",
        "readTime": 3,
        "image": "/news/news3.png",
        "tags": [
            "GBP/USD",
            "BoE",
            "Inflation",
            "CPI",
            "Interest rates"
        ]
    },
    {
        "id": 4,
        "title": "USD/JPY approaches 151.00 level",
        "excerpt": "The USD/JPY pair is approaching the 151.00 level, the highest in 34 years, raising concerns about BoJ intervention.",
        "content": "The USD/JPY pair is approaching the 151.00 level, the highest in 34 years, raising concerns about potential intervention from the BoJ (Bank of Japan). The strong rise in USD/JPY is mainly due to the large interest rate differential between the US and Japan. The Fed is maintaining high interest rates while the BoJ keeps rates near zero. Experts believe the BoJ may intervene if USD/JPY surpasses 151.00 to protect the yen. However, the effectiveness of intervention could be limited due to the fundamental interest rate gap. Traders should be cautious when trading USD/JPY at this time and watch for BoJ statements.",
        "category": "Fundamental Analysis",
        "author": "Pham Thi D",
        "publishedAt": "2024-03-17T16:45:00Z",
        "readTime": 4,
        "image": "/news/news4.png",
        "tags": [
            "USD/JPY",
            "BoJ",
            "Intervention",
            "Yen",
            "Interest rates"
        ]
    },
    {
        "id": 5,
        "title": "AUD/USD drops after weak jobs report",
        "excerpt": "The Australian dollar fell sharply after the February jobs report came in weaker than expected, increasing expectations of an RBA rate cut.",
        "content": "The Australian dollar fell sharply after the February jobs report came in weaker than expected, increasing expectations that the RBA (Reserve Bank of Australia) will cut interest rates soon. The number of new jobs rose by only 5,000 compared to the expected 25,000, and the unemployment rate increased from 3.9% to 4.1%. This pushed AUD/USD from 0.6650 to 0.6600. Experts believe the RBA could cut rates sooner than expected to support the economy. However, inflation remains high and the RBA may act cautiously when reducing rates. Traders should monitor key upcoming Australian economic reports next week.",
        "category": "Market News",
        "author": "Hoang Van E",
        "publishedAt": "2024-03-16T11:20:00Z",
        "readTime": 3,
        "image": "/news/news5.jpg",
        "tags": [
            "AUD/USD",
            "RBA",
            "Jobs",
            "Unemployment",
            "Interest rates"
        ]
    },
    {
        "id": 6,
        "title": "USD/CAD rises after Canada GDP report",
        "excerpt": "The USD/CAD pair rose sharply after Canada’s Q4 2023 GDP report came in below expectations.",
        "content": "The USD/CAD pair rose sharply after Canada’s Q4 2023 GDP report came in below expectations. GDP growth was only 0.2% compared to the expected 0.5%, indicating the Canadian economy is slowing down. This pushed USD/CAD from 1.3500 to 1.3600. Experts believe the BoC (Bank of Canada) could cut interest rates sooner than expected to support the economy. However, it should be noted that crude oil prices (WTI) are rising sharply, which could support the Canadian dollar. Traders should watch key upcoming Canadian economic reports and oil prices.",
        "category": "Fundamental Analysis",
        "author": "Vu Thi F",
        "publishedAt": "2024-03-15T13:10:00Z",
        "readTime": 3,
        "image": "/news/news6.jpg",
        "tags": [
            "USD/CAD",
            "BoC",
            "GDP",
            "Crude oil",
            "Canadian economy"
        ]
    },
    {
        "id": 7,
        "title": "NZD/USD rises after New Zealand inflation report",
        "excerpt": "The New Zealand dollar rose sharply after Q4 2023 inflation came in higher than expected.",
        "content": "The New Zealand dollar rose sharply after Q4 2023 inflation came in higher than expected. The CPI rose 4.7% year-on-year, above the forecast of 4.3%. This pushed NZD/USD from 0.6150 to 0.6200. Experts believe the RBNZ (Reserve Bank of New Zealand) may keep interest rates high for longer to control inflation. However, it should be noted that the New Zealand economy is struggling, and maintaining high rates could slow growth. Traders should watch key upcoming New Zealand economic reports.",
        "category": "Market News",
        "author": "Dang Van G",
        "publishedAt": "2024-03-14T15:30:00Z",
        "readTime": 3,
        "image": "/news/news7.jpeg",
        "tags": [
            "NZD/USD",
            "RBNZ",
            "Inflation",
            "CPI",
            "Interest rates"
        ]
    },
    {
        "id": 8,
        "title": "Technical analysis: EUR/GBP could rise",
        "excerpt": "According to technical analysis, the EUR/GBP pair could rise in the short term due to favorable technical indicators.",
        "content": "According to technical analysis, the EUR/GBP pair could rise in the short term due to favorable technical indicators. The pair is forming a double bottom pattern at 0.8550, suggesting a potential rebound. The RSI is at 35, indicating the market is oversold and may see a recovery. The MACD is also showing a bullish divergence signal. However, it should be noted that the long-term trend remains bearish, and traders should exercise caution. Short-term upside targets could be 0.8600 and 0.8650. Traders should monitor key upcoming economic events in both the Eurozone and the UK.",
        "category": "Technical Analysis",
        "author": "Ngo Thi H",
        "publishedAt": "2024-03-13T10:45:00Z",
        "readTime": 4,
        "image": "/news/news8.jpeg",
        "tags": [
            "EUR/GBP",
            "Technical Analysis",
            "Double bottom",
            "RSI",
            "MACD"
        ]
    }
]