[
    {
        "id": 1,
        "title": "Forex là gì? Hướng dẫn cơ bản cho người mới",
        "excerpt": "Forex (Foreign Exchange) là thị trường giao dịch tiền tệ toàn cầu, nơi các đồng tiền được trao đổi với nhau.",
        "content": "Forex (Foreign Exchange) là thị trường giao dịch tiền tệ toàn cầu, nơi các đồng tiền được trao đổi với nhau. Đây là thị trường tài chính lớn nhất thế giới với khối lượng giao dịch hàng ngày lên đến 6.6 nghìn tỷ USD. Thị trường forex hoạt động 24/7, từ thứ Hai đến thứ Sáu, cho phép các trader giao dịch bất cứ lúc nào. Các cặp tiền chính bao gồm EUR/USD, GBP/USD, USD/JPY, USD/CHF, AUD/USD, USD/CAD, và NZD/USD. Giao dịch forex có thể mang lại lợi nhuận cao nhưng cũng tiềm ẩn rủi ro lớn. Do đó, người mới bắt đầu nên học hỏi kỹ lưỡng trước khi tham gia giao dịch thực. Các khái niệm cơ bản cần nắm vững bao gồm: pip, lot, spread, leverage, margin, và các loại lệnh giao dịch.",
        "category": "Kiến thức cơ bản",
        "level": "Cơ bản",
        "author": "Nguyễn Văn A",
        "publishedAt": "2024-03-20T10:00:00Z",
        "readTime": 8,
        "image": "https://via.placeholder.com/800x400/2563eb/ffffff?text=Forex+Basics",
        "tags": ["Forex", "Cơ bản", "Giao dịch", "Tiền tệ", "Thị trường"]
    },
    {
        "id": 2,
        "title": "Phân tích kỹ thuật: Các mô hình biểu đồ quan trọng",
        "excerpt": "Phân tích kỹ thuật là phương pháp dự đoán xu hướng giá dựa trên các mô hình biểu đồ và chỉ báo kỹ thuật.",
        "content": "Phân tích kỹ thuật là phương pháp dự đoán xu hướng giá dựa trên các mô hình biểu đồ và chỉ báo kỹ thuật. Các mô hình biểu đồ quan trọng bao gồm: Head and Shoulders, Double Top/Bottom, Triangle, Flag, Pennant, và Cup and Handle. Mỗi mô hình có ý nghĩa khác nhau và có thể báo hiệu xu hướng tăng hoặc giảm. Các chỉ báo kỹ thuật phổ biến bao gồm: Moving Average, RSI, MACD, Bollinger Bands, và Stochastic. Việc kết hợp nhiều chỉ báo và mô hình sẽ giúp tăng độ chính xác của phân tích. Tuy nhiên, cần lưu ý rằng phân tích kỹ thuật không phải là công cụ hoàn hảo và có thể có sai số. Các trader nên kết hợp với phân tích cơ bản để có cái nhìn toàn diện về thị trường.",
        "category": "Phân tích kỹ thuật",
        "level": "Trung cấp",
        "author": "Trần Thị B",
        "publishedAt": "2024-03-19T14:30:00Z",
        "readTime": 12,
        "image": "https://via.placeholder.com/800x400/10b981/ffffff?text=Technical+Analysis",
        "tags": ["Phân tích kỹ thuật", "Mô hình biểu đồ", "Chỉ báo", "RSI", "MACD"]
    },
    {
        "id": 3,
        "title": "Phân tích cơ bản: Các yếu tố ảnh hưởng đến tỷ giá",
        "excerpt": "Phân tích cơ bản tập trung vào các yếu tố kinh tế, chính trị và xã hội ảnh hưởng đến tỷ giá tiền tệ.",
        "content": "Phân tích cơ bản tập trung vào các yếu tố kinh tế, chính trị và xã hội ảnh hưởng đến tỷ giá tiền tệ. Các yếu tố kinh tế quan trọng bao gồm: GDP, lạm phát, lãi suất, tỷ lệ thất nghiệp, và cán cân thương mại. Các yếu tố chính trị bao gồm: bầu cử, chính sách của chính phủ, và quan hệ quốc tế. Các yếu tố xã hội bao gồm: thiên tai, dịch bệnh, và các sự kiện lớn. Các báo cáo kinh tế quan trọng cần theo dõi bao gồm: Non-Farm Payrolls, CPI, GDP, và các cuộc họp của ngân hàng trung ương. Việc hiểu rõ các yếu tố này sẽ giúp trader đưa ra quyết định giao dịch chính xác hơn.",
        "category": "Phân tích cơ bản",
        "level": "Trung cấp",
        "author": "Lê Văn C",
        "publishedAt": "2024-03-18T09:15:00Z",
        "readTime": 10,
        "image": "https://via.placeholder.com/800x400/f59e0b/ffffff?text=Fundamental+Analysis",
        "tags": ["Phân tích cơ bản", "GDP", "Lạm phát", "Lãi suất", "Báo cáo kinh tế"]
    },
    {
        "id": 4,
        "title": "Quản lý rủi ro trong giao dịch forex",
        "excerpt": "Quản lý rủi ro là yếu tố quan trọng nhất trong giao dịch forex, giúp bảo vệ vốn và tối đa hóa lợi nhuận.",
        "content": "Quản lý rủi ro là yếu tố quan trọng nhất trong giao dịch forex, giúp bảo vệ vốn và tối đa hóa lợi nhuận. Nguyên tắc cơ bản của quản lý rủi ro là không bao giờ rủi ro quá 1-2% vốn cho mỗi giao dịch. Các công cụ quản lý rủi ro bao gồm: Stop Loss, Take Profit, và Position Sizing. Stop Loss giúp giới hạn thua lỗ, Take Profit giúp chốt lời, và Position Sizing giúp tính toán khối lượng giao dịch phù hợp. Các trader cũng nên đa dạng hóa danh mục đầu tư và không đặt tất cả trứng vào một giỏ. Việc giữ một journal giao dịch sẽ giúp theo dõi hiệu suất và học hỏi từ các sai lầm.",
        "category": "Quản lý rủi ro",
        "level": "Trung cấp",
        "author": "Phạm Thị D",
        "publishedAt": "2024-03-17T16:45:00Z",
        "readTime": 8,
        "image": "https://via.placeholder.com/800x400/ef4444/ffffff?text=Risk+Management",
        "tags": ["Quản lý rủi ro", "Stop Loss", "Take Profit", "Position Sizing", "Vốn"]
    },
    {
        "id": 5,
        "title": "Tâm lý giao dịch: Kiểm soát cảm xúc",
        "excerpt": "Tâm lý giao dịch đóng vai trò quan trọng trong thành công của trader, ảnh hưởng trực tiếp đến quyết định giao dịch.",
        "content": "Tâm lý giao dịch đóng vai trò quan trọng trong thành công của trader, ảnh hưởng trực tiếp đến quyết định giao dịch. Các cảm xúc tiêu cực thường gặp bao gồm: sợ hãi, tham lam, và hy vọng. Sợ hãi có thể khiến trader đóng lệnh sớm hoặc không dám vào lệnh. Tham lam có thể khiến trader giữ lệnh quá lâu hoặc tăng khối lượng giao dịch. Hy vọng có thể khiến trader bỏ qua các tín hiệu bán. Để kiểm soát cảm xúc, trader nên: tuân thủ kế hoạch giao dịch, không giao dịch khi tâm trạng không tốt, và thực hành thiền định. Việc giữ một journal cảm xúc cũng giúp nhận diện và kiểm soát các cảm xúc tiêu cực.",
        "category": "Tâm lý giao dịch",
        "level": "Nâng cao",
        "author": "Hoàng Văn E",
        "publishedAt": "2024-03-16T11:20:00Z",
        "readTime": 6,
        "image": "https://via.placeholder.com/800x400/8b5cf6/ffffff?text=Trading+Psychology",
        "tags": ["Tâm lý giao dịch", "Cảm xúc", "Sợ hãi", "Tham lam", "Kế hoạch giao dịch"]
    },
    {
        "id": 6,
        "title": "Chiến lược giao dịch: Scalping vs Swing Trading",
        "excerpt": "Scalping và Swing Trading là hai chiến lược giao dịch phổ biến với đặc điểm và rủi ro khác nhau.",
        "content": "Scalping và Swing Trading là hai chiến lược giao dịch phổ biến với đặc điểm và rủi ro khác nhau. Scalping là chiến lược giao dịch ngắn hạn, thường giữ lệnh từ vài giây đến vài phút. Chiến lược này phù hợp với các trader có kinh nghiệm và có thể dành nhiều thời gian theo dõi thị trường. Swing Trading là chiến lược giao dịch trung hạn, thường giữ lệnh từ vài ngày đến vài tuần. Chiến lược này phù hợp với các trader bán thời gian và không muốn dành quá nhiều thời gian theo dõi thị trường. Mỗi chiến lược có ưu và nhược điểm riêng, trader nên chọn chiến lược phù hợp với tính cách và lối sống của mình.",
        "category": "Chiến lược giao dịch",
        "level": "Trung cấp",
        "author": "Vũ Thị F",
        "publishedAt": "2024-03-15T13:10:00Z",
        "readTime": 7,
        "image": "https://via.placeholder.com/800x400/06b6d4/ffffff?text=Trading+Strategy",
        "tags": ["Chiến lược giao dịch", "Scalping", "Swing Trading", "Ngắn hạn", "Trung hạn"]
    },
    {
        "id": 7,
        "title": "Công cụ giao dịch: MetaTrader 4 và 5",
        "excerpt": "MetaTrader 4 và 5 là các nền tảng giao dịch phổ biến nhất trong thị trường forex.",
        "content": "MetaTrader 4 và 5 là các nền tảng giao dịch phổ biến nhất trong thị trường forex. MetaTrader 4 được phát triển từ năm 2005 và vẫn được sử dụng rộng rãi. MetaTrader 5 được phát triển từ năm 2010 với nhiều tính năng nâng cao hơn. Các tính năng chính bao gồm: biểu đồ giá, chỉ báo kỹ thuật, Expert Advisors (EA), và backtesting. MetaTrader 5 có thêm các tính năng như: giao dịch cổ phiếu, futures, và options. Cả hai nền tảng đều hỗ trợ giao dịch tự động thông qua EA và có thể được tùy chỉnh theo nhu cầu của trader. Việc học cách sử dụng các nền tảng này là bước quan trọng trong hành trình trở thành trader chuyên nghiệp.",
        "category": "Công cụ giao dịch",
        "level": "Cơ bản",
        "author": "Đặng Văn G",
        "publishedAt": "2024-03-14T15:30:00Z",
        "readTime": 9,
        "image": "https://via.placeholder.com/800x400/16a34a/ffffff?text=MetaTrader",
        "tags": ["MetaTrader", "MT4", "MT5", "EA", "Backtesting"]
    },
    {
        "id": 8,
        "title": "Giao dịch tự động với Expert Advisors",
        "excerpt": "Expert Advisors (EA) là các chương trình tự động thực hiện giao dịch dựa trên các quy tắc được lập trình sẵn.",
        "content": "Expert Advisors (EA) là các chương trình tự động thực hiện giao dịch dựa trên các quy tắc được lập trình sẵn. EA có thể giúp trader loại bỏ cảm xúc và thực hiện giao dịch 24/7. Tuy nhiên, việc sử dụng EA cũng tiềm ẩn rủi ro cao nếu không được lập trình và test kỹ lưỡng. Các loại EA phổ biến bao gồm: Trend Following, Mean Reversion, và Arbitrage. Trước khi sử dụng EA thực, trader nên test trên tài khoản demo và backtest trên dữ liệu lịch sử. Việc hiểu rõ logic của EA và có khả năng lập trình sẽ giúp trader tùy chỉnh và tối ưu hóa EA theo nhu cầu của mình.",
        "category": "Công cụ giao dịch",
        "level": "Nâng cao",
        "author": "Ngô Thị H",
        "publishedAt": "2024-03-13T10:45:00Z",
        "readTime": 11,
        "image": "https://via.placeholder.com/800x400/d946ef/ffffff?text=Expert+Advisors",
        "tags": ["Expert Advisors", "EA", "Giao dịch tự động", "MQL", "Backtesting"]
    }
] 